package third_modul.seventh;

public class SeventhHomework {
    /*
    1) Создайте собственный класс Phone, полями которого будут название производителя, название модели и стоимость.
    Создайте ArrayList из нескольких объектов класса Phone. С помощью Stream API создайте ArrayList моделей конкретного производителя.

    2) Реализуйте интерфейс Comparable для класса Phone из предыдущего задания так, чтобы модели сортировались по стоимости.
    С помощью StreamAPI отсортируйте список объектов класса Phone и выведите названия моделей и стоимость.
     */
}
